# St7RemoveBeamReferenceNode

Converts selected Beam3 elements into Beam2 elements with Principal Axis Angle attributes to provide the
equivalent orientation.

long St7RemoveBeamReferenceNode(long uID)

Input Parameters

uID

Strand7 model file ID.

Dependencies
Selection

Beams can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.